#### 2021/11/29
#### https://datascienceschool.net/
#### 4.1.1, 4.1.2, 4.1.3, 4.3.1 연습문제

In [6]:
import numpy as np
import pandas as pd

## 연습 문제 4.1.1
- (1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

- (2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [7]:
a = pd.Series([101, 2254, 3415, 414], index=['가', '나', '다', '라'])
b = pd.Series([101, 244, 3415, 144], index=['가', '마', '다', '사'])
a, b

(가     101
 나    2254
 다    3415
 라     414
 dtype: int64,
 가     101
 마     244
 다    3415
 사     144
 dtype: int64)

In [8]:
a + 100, b - 50, a / 100, b * 2

(가     201
 나    2354
 다    3515
 라     514
 dtype: int64,
 가      51
 마     194
 다    3365
 사      94
 dtype: int64,
 가     1.01
 나    22.54
 다    34.15
 라     4.14
 dtype: float64,
 가     202
 마     488
 다    6830
 사     288
 dtype: int64)

In [9]:
a * b, a / b, a + b, a - b

(가       10201.0
 나           NaN
 다    11662225.0
 라           NaN
 마           NaN
 사           NaN
 dtype: float64,
 가    1.0
 나    NaN
 다    1.0
 라    NaN
 마    NaN
 사    NaN
 dtype: float64,
 가     202.0
 나       NaN
 다    6830.0
 라       NaN
 마       NaN
 사       NaN
 dtype: float64,
 가    0.0
 나    NaN
 다    0.0
 라    NaN
 마    NaN
 사    NaN
 dtype: float64)

## 연습 문제 4.1.2
- 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

    - (1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

    - (2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [10]:
data = {
    '1': [8, 'xl', 178.57, '바나나', 1000],
    '2': [5, 'wb', 157.5, '사과', 5000],
    '3': [2, 'lb', 124.7, '딸기', 3000],
    '4': [1, 'yb', 190.24, '포도', 4000],
    '5': [10, 'iq', 482.9, '아보카도', 200],
    '분류': ['횟수', '이름', '키', '구매 과일', '가격']
}
columns = ['1','2','3','4','5']
index = ['횟수', '이름', '키', '구매 과일', '가격']
df = pd.DataFrame(data, index=index, columns=columns)
df

            1      2      3       4      5
횟수          8      5      2       1     10
이름         xl     wb     lb      yb     iq
키      178.57  157.5  124.7  190.24  482.9
구매 과일     바나나     사과     딸기      포도   아보카도
가격       1000   5000   3000    4000    200

## 연습 문제 4.1.3
#### 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

- (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

- (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

- (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

- (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

- (5) 춘향의 점수를 데이터프레임으로 나타낸다.

- (6) 향단의 점수를 시리즈로 나타낸다.

In [11]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [12]:
# (1)
df['수학'] # 시리즈로 반환

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [13]:
df[['수학']] # 데이터프레임으로 반환

    수학
춘향  90
몽룡  60
향단  80
방자  70

In [14]:
# (2)
df[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [15]:
# (3)
df['평균'] = np.mean(df.values, axis=1).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [36]:
# 풀이
df['평균'] = df.mean(axis=1).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  59.79

In [45]:
df['평균2'] = np.mean(df.values[:,:-1], axis=1).round(2)
# 앞에 계산한 평균 값을 계산에 넣지 않기 위해 슬라이스
df

    국어  영어  수학     평균    평균2
춘향  80  90  90  86.67  86.67
몽룡  90  70  60  73.33  73.33
향단  70  60  80  70.00  70.00
방자  30  80  70  59.79  59.95

In [20]:
# (4)
df['영어']['방자'] = 80
df['평균'] = np.mean(df.values, axis = 1).round(2)
df

<ipython-input-20-c01ecc81c448>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['영어']['방자'] = 80

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  59.17

In [46]:
# 풀이
df.drop(columns=['평균','평균2'], inplace=True)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [48]:
df['영어']['방자'] = 80
df['평균'] = df.mean(axis=1).round(2)

In [47]:
import warnings
warnings.filterwarnings('ignore')
# 워닝메시지를 보고 싶지 않을 때

In [31]:
# (5)
df[:1] # 행 단위로 인덱싱 할 때는 항상 슬라이싱

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [49]:
# 풀이
df.head(1)

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [51]:
df.head(3).tail(1)

    국어  영어  수학    평균
향단  70  60  80  70.0

In [54]:
df.T[['춘향']] # 열과 행을 전치해서 열을 인덱싱

       춘향
국어  80.00
영어  90.00
수학  90.00
평균  86.67

In [55]:
df[:'춘향']

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [34]:
# (6)
df[2:3]

    국어  영어  수학    평균
향단  70  60  80  70.0

In [56]:
# 풀이
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

# 연습문제 4.3.1

In [58]:
# 1) 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
df = pd.DataFrame(np.arange(25).reshape(5,5), columns=list('ABCDE'), index=list('vwxyz'))
df

    A   B   C   D   E
v   0   1   2   3   4
w   5   6   7   8   9
x  10  11  12  13  14
y  15  16  17  18  19
z  20  21  22  23  24

In [64]:
# 2) 10가지 이상의 방법으로 특정한 행과 열을 선택한다.
df['C']['x'], df['C'][2], df.C['x'], df.C[2], df.C.x

(12, 12, 12, 12, 12)

In [69]:
# loc indexer
df.loc['x','C'], df.loc['x'][2], df.loc['x']['C']

(12, 12, 12)

In [70]:
# iloc indexer
df.iloc[2,2], df.iloc[2]['C'], df.iloc[2][2]

(12, 12, 12)

In [71]:
df['C'].x

12